package Day46多用户即时通信系统;

public class 项目开发流程简介 {
	/*
	 * 第一阶段：需求分析：
	 *     1.需求分析师（要求：懂技术+懂行业）
	 *     2.出一个需求分析报告（白皮书），说明该项目的功能，客户具体要求
	 *     
	 * 第二阶段：设计阶段
	 *     1.架构师/项目经理
	 *     2.设计工作（UML类图，流程图，模块设计，数据库的设计，架构）
	 *     3.原型开发
	 *     4.组建团队
	 * 
	 * 第三阶段：实现阶段
	 *     1.程序员
	 *     2.完成架构师的模块功能
	 *     3.测试自己写的模块
	 *     
	 * 第四阶段：测试阶段
	 *     1.测试工程师
	 *     2.单元测试，测试用例，白盒测试，黑盒测试，集成测试
	 *     
	 * 第五阶段：实施阶段
	 *     1.实施工程师（开发能力不要求很高，但是环境配置和部署能力要高）
	 *     2.项目正确的部署到客户的平台，并保证，运行正常
	 *     
	 * 第六阶段：维护阶段
	 *     1.被发现bug，就要去解决bug/项目升级
	 */
}
