package Day78Java9新特性7;

public class Java9中看不到的API {
	/*
	 * 1.1一个标准化和轻量级的JSON API
	 * 
	 * 1.2新的货币 API
	 *      对许多应用而言货币价值都是一个关键的特性，但JDK对此却几乎没有任何支持。
	 *      【如果项目当中涉及到了货币的话，可以参照：https://github.com/JavaMoney，里面已经给出了使用说明和示例】
	 *      
	 * 展望：
	 *     （1）Java对标C/C++，以抛掉内存管理为卖点，却又陷入了JVM优化的噩梦
	 *     （2）Java需要在新的计算场景下，改进开发效率
	 *     （3）随着云计算和AI等技术浪潮，当前的计算模式和场景正在发生翻天覆地的变化，
	 *          深刻影响着Java技术的发展方向以及对发展速度提出了更高的要求，
	 *          传统的大型企业或互联网应用，正在被云端，容器化应用，模块化的微服务甚至是函数（FaaS,Function-as-a-Service）所替代。
	 */
}
