package Day79Java内容介绍;

public class Java内容介绍 {
	/*
	 * Java基础 == JavaSE
	 * Java就业方向：
	 *     （1）JavaEE软件工程师
	 *         1.电商
	 *         2.团购
	 *         3.众筹
	 *         4.SNS（社交网络）
	 *         5.教育
	 *         6.金融
	 *         7.搜索
	 *     （2）大数据软件工程师
	 *         1.大数据应用工程师
	 *         2.大数据算法工程师
	 *         3.大数据分析和挖掘
	 *     （3）Android软件工程师
	 *         Android平台方面的工作
	 *         
	 * 
	 * Java开发场景（SSM）：
	 *     （1）Spring（轻量级的容器框架）
	 *     （2）SpringMVC（分层的web开发框架）
	 *     （3）MyBatis（持久化框架）
	 *     
	 * Java的应用领域：
	 *     （1）企业级应用
	 *         主要是指复杂的大企业的软件系统，各种类型的网站。应用领域包括金融，电信，交通，电子商务等等。
	 *     （2）安卓平台应用
	 *     （3）移动领域应用
	 *         主要表现在消费和嵌入式领域，是指各种在小型设备上的应用，包括机顶盒，车载的大屏影音娱乐设备，汽车通信设备，扫码的POS机等等。
	 */
}
