package Day28Multithreading2;

public class Test{
	public static void main(String[] args) {
		/*
		 * 一：多线程的应用场景：
		 *     （1）客户端【移动APP端（安卓/IOS）】开发
		 *     （2）异步地发送短信/发送邮件
		 *     （3）将执行比较耗时的代码改用多线程异步执行
		 *     （4）异步写入日志（日志框架的底层原理就使用到了多线程的技术）
		 *     （5）多线程下载（例如：百度网盘下载能支持多个文件同时下载，也相当于一个多线程）
		 *     
		 * 二：同步与异步：
		 *     同步：就算代码从上向下执行
		 *     异步：单独分支执行，相互之间没有任何影响
		 *     
		 * 三：多线程创建方式：
		 *     （1）继承Thread类创建线程
		 *     （2）实现Runnable接口创建线程
		 *     （3）使用匿名内部类的形式创建线程
		 *     （4）使用lambda表达式创建线程
		 *     （5）使用Callable和Future创建线程
		 *     （6）使用线程池例如用Executor矿建
		 *     （7）spring@Async异步注解
		 */
		
		
	}
}
